# Temas vistos el 28 de noviembre del 2022
[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/danielroa98/Postgrad-ML/blob/main/Module-1/30_Nov_2022_lec_07_M1G6P_DRG.ipynb)

In [1]:
import pandas as pd
import numpy as np

In [2]:
from functools import reduce

## Continuación de la clase del [28 de noviembre del 2022](./28_Nov_2022_lec_06_M1G6P_DRG.ipynb)

### Función `filter()`

Nos permite filtrar elementos de una secuencia (listas, conjuntos, tuples, etc...), a través de una función que cumpla con cierto criterio.

Sintaxis:

`filter(f(), sequence)` -> devuelve los elementos de la secuencia que son `True` según las condiciones impuestas por la función `f()`.

In [3]:
emp = pd.read_csv('./Datasets/employees_2.csv', parse_dates=['Start Date', 'Last Login Time'])
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2022-11-30 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2022-11-30 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2022-11-30 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2022-11-30 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2022-11-30 16:47:00,101004,1.389,True,Client Services

In [4]:
def is_male(emp_gender):
    if emp_gender == 'Male':
        return True
    else:
        return False

In [5]:
# Esto regresa los elementos de la columna 'Gender' que sean 'True' bajo la condición impuesta por la función is_male().
list(filter(is_male, emp['Gender']))

['Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male',
 'Male']

In [6]:
# También se puede convertir en un Series.
pd.Series(list(filter(is_male, emp['Gender'])))

0      Male
1      Male
2      Male
3      Male
4      Male
       ...
419    Male
420    Male
421    Male
422    Male
423    Male
Length: 424, dtype: object

También se puede aplicar funciones lambda/anónimas.

In [7]:
lst = [1,2,3,4,5,6,7,8,9,10]
pares = list(filter(lambda l:l%2 == 0, lst))

print(pares)

[2, 4, 6, 8, 10]

In [8]:
impares = list(filter(lambda l:l%2 != 0, lst))

print(impares)

[1, 3, 5, 7, 9]

Alternativa a lo anterior

Sólo se modificó la operación lógica de `!=` a `~` antes de terminar de declarar la función lambda.

In [9]:
impares = list(filter(lambda l:~l%2 == 0, lst))

print(impares)

[1, 3, 5, 7, 9]

1) Definir una función que verifique que elementos de una lista son vocales

In [10]:
def find_vowels(lttr):
    vowels = ['a','e','i','o','u']
    if lttr in vowels:
        return True
    else:
        return False

In [11]:
sqnce = ['f', 'a', 'b', 'g', 'z', 'a', 'e']
filtrados = filter(find_vowels, sqnce)

print(list(filtrados))

['a', 'a', 'e']

2) Encontrar la intersección de dos listas utilizando una función lambda

In [12]:
lst1 = [1,2,3,5,7,9,11,12,20]
lst2 = [2,5,11,9]

# Filtra los elementos de la segunda lista (lst2) que cumplen con la restricción de la función.
## Es decir: x:x in lst1
print(list(filter(lambda x:x in lst1, lst2)))

[2, 5, 11, 9]

3) Encontrar la diferencia entre la lista 1 y la lista 2
(`lst1 \ lst2`)

In [13]:
lst1 = [1,2,3,5,7,9,11,12,20]
lst2 = [2,5,11,9]

print(list(filter(lambda x:x not in lst2, lst1)))

[1, 3, 7, 12, 20]

Prueba con un string

In [14]:
word1 = 'sequence'
word2 = 'consequence'

print(list(filter(lambda x:x in word2, word1)))

['s', 'e', 'q', 'u', 'e', 'n', 'c', 'e']

### Función map()

La función `map()` aplica una función _f_ a un iterable _X_ de __n__ elementos entrada por salida:

```python
map(f,X) = [f(x1),f(x2), ...,f(xn)]
```

Donde X = (x1, x2, ..., xn)

__map()__ siempre regresa un iterable, pero para ver sus valores lo pasamos a una lista.

#### Ejemplo 1:

Se quiere elevar al cuadrado cada elemento de un rango

In [15]:
rango = map(lambda x:x**2, range(1, 11))
print(list(rango))

[1, 4, 9, 16, 25, 36, 49, 64, 81, 100]

El siguiente ejemplo va a marcar un error, esto es porque _range_ no tiene el método:
```python
apply()
```

In [16]:
rango = range(1,11)
rango.apply(lambda x:x**2)

AttributeError: 'range' object has no attribute 'apply'

Para solucionar lo anterior, se puede convertir el rango a una serie

In [18]:
pd.Series(rango).apply(lambda x:x**2)

0      1
1      4
2      9
3     16
4     25
5     36
6     49
7     64
8     81
9    100
dtype: int64

#### Ejemplo 2
Aplicar una función donde los argumentos provienene de diferentes rangos.

i.e. Suponemos que _x_ pertence a __range(a1, b1)__, _y_ pertenece a __range(a2, b2)__

In [19]:
res = list(map(lambda x,y:x+y, range(1,11), range(10,100)))

print(res)

[11, 13, 15, 17, 19, 21, 23, 25, 27, 29]

Del bloque anterior, aunque los rangos sean de diferentes tamaños, la función __map()__ se fija en la misma cantidad de valores en cada uno.

In [20]:
lst1 = [1,2,3]
lst2 = [4,5,6]

res = list(map(lambda x,y:x+y, lst1, lst2))
print(res)

[5, 7, 9]

In [21]:
# Unión de las dos listas
lst1 + lst2

[1, 2, 3, 4, 5, 6]

In [22]:
lst1 = [1,2,3]
lst2 = [4,5,6]
lst3 = [7,8,9]

res = list(map(lambda x,y,z: x+y+z, lst1, lst2, lst3))
print(res)

[12, 15, 18]

¡Nota rápida!

Si se aplica la función list() a un String, se le hará un split automáticamente.

```python
list('monday')

> ['m', 'o', 'n', 'd', 'a', 'y']
```

In [23]:
# Aplicaciones dentro de NLP (Natural Language Processing)
lst = ['lu', 'ma','mie','jue','vie']
res = map(list, lst)

print(list(res))

[['l', 'u'], ['m', 'a'], ['m', 'i', 'e'], ['j', 'u', 'e'], ['v', 'i', 'e']]

### Ejercicios de filter y map

In [24]:
z = filter(lambda x:(x >= 5), (3,4,5,6,7))

print(list(z))

[5, 6, 7]

In [25]:
# Sin importar el tamaño del iterable, va a aplicar 
reduce(lambda x,y: x+y, [11,12,14,15])

52

In [30]:
## Funciones adicionales

### set_index()

In [26]:
# Cuando pasa un .CSV con el param index_col,
## convierte la columna especificada en el índice del DataFrame.
emp = pd.read_csv('./Datasets/employees_2.csv', index_col='First Name')
emp.head()

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [38]:
emp = pd.read_csv('./Datasets/employees_2.csv')
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

In [29]:
#Keys param es la columna que se desea usar como índice
emp.set_index(keys='First Name', inplace=True)
emp.head()

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

### reset_index()

In [31]:
emp.reset_index(inplace=True)
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services

Siempre que se quiera cambiar un índice, es buena idea poner un __reset_index()__ por si llega a ser necesario.

In [32]:
emp.set_index('Start Date', inplace=True)
emp.head()

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
8/6/1993,Douglas,Male,12:42 PM,97308,6.945,True,Marketing
3/31/1996,Thomas,Male,6:53 AM,61933,4.170,True,NaN
4/23/1993,Maria,Female,11:17 AM,130590,11.858,False,Finance
3/4/2005,Jerry,Male,1:00 PM,138705,9.340,True,Finance
1/24/1998,Larry,Male,4:47 PM,101004,1.389,True,Client Services

### Acceder a registros usando ```.loc[]``` (accesos)

In [44]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: datetime64[ns](1), float64(1), int64(1), object(5)
memory usage: 62.6+ KB

In [43]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'])
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 PM,101004,1.389,True,Client Services

In [45]:
emp.set_index('Start Date', inplace=True)
emp.sort_index(inplace=True)
emp.head()

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
1980-01-19,Joe,Male,4:06 PM,119667,1.148,True,Finance
1980-01-24,Chris,NaN,12:13 PM,113590,3.055,False,Sales
1980-01-28,Ruby,Female,11:08 PM,142868,6.318,False,Marketing
1980-02-20,Fred,Male,2:25 AM,74129,18.225,False,Product
1980-02-25,Sara,Female,10:50 PM,75484,3.186,False,Finance

In [46]:
emp.tail()

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
2016-05-12,Lillian,NaN,3:43 PM,64164,17.612,False,Human Resources
2016-05-24,NaN,Male,9:17 PM,76409,7.008,NaN,Distribution
2016-06-05,Lillian,Female,6:09 AM,59414,1.256,False,Product
2016-06-16,Tina,Female,7:47 PM,100705,16.961,True,Marketing
2016-07-15,Terry,NaN,12:29 AM,140002,19.490,True,Marketing

## `.loc[]` es para acceder a registros mediante _etiquetas de índices_

No es por posición

1) Ejemplo: si queremos acceder al registro con Start Date '1980-08-12'...

In [47]:
emp.loc['1980-08-12']

First Name            Louise
Gender                Female
Last Login Time      9:01 AM
Salary                 63241
Bonus %               15.132
Senior Management       True
Team                     NaN
Name: 1980-08-12 00:00:00, dtype: object

In [48]:
type(emp.loc['1980-08-12'])

pandas.core.series.Series

In [49]:
emp.reset_index(inplace=True)
emp.set_index('First Name', inplace=True)
emp.head()

,Start Date,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Joe,1980-01-19,Male,4:06 PM,119667,1.148,True,Finance
Chris,1980-01-24,NaN,12:13 PM,113590,3.055,False,Sales
Ruby,1980-01-28,Female,11:08 PM,142868,6.318,False,Marketing
Fred,1980-02-20,Male,2:25 AM,74129,18.225,False,Product
Sara,1980-02-25,Female,10:50 PM,75484,3.186,False,Finance

In [50]:
emp.loc['Jeremy']

,Start Date,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Jeremy,1981-08-12,Male,12:05 AM,46930,18.702,True,Finance
Jeremy,1988-06-14,Male,6:20 PM,129460,13.657,True,NaN
Jeremy,1991-05-19,Male,1:40 PM,131513,1.876,True,Finance
Jeremy,1994-05-29,Male,6:24 AM,47885,19.276,True,Human Resources
Jeremy,1996-11-10,NaN,1:49 PM,55394,3.180,True,Sales
Jeremy,1997-11-26,Male,8:22 AM,133033,12.200,False,Sales
Jeremy,2000-06-08,Male,12:15 AM,49542,1.679,True,Distribution
Jeremy,2001-08-09,Male,3:56 AM,43354,13.946,False,Marketing
Jeremy,2008-02-01,Male,8:50 AM,100238,3.887,True,Client Services
Jeremy,2010-09-21,Male,5:56 AM,90370,7.369,False,Human Resources

In [51]:
emp.loc[['Jeremy', 'Joe']]

,Start Date,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Jeremy,1981-08-12,Male,12:05 AM,46930,18.702,True,Finance
Jeremy,1988-06-14,Male,6:20 PM,129460,13.657,True,NaN
Jeremy,1991-05-19,Male,1:40 PM,131513,1.876,True,Finance
Jeremy,1994-05-29,Male,6:24 AM,47885,19.276,True,Human Resources
Jeremy,1996-11-10,NaN,1:49 PM,55394,3.180,True,Sales
Jeremy,1997-11-26,Male,8:22 AM,133033,12.200,False,Sales
Jeremy,2000-06-08,Male,12:15 AM,49542,1.679,True,Distribution
Jeremy,2001-08-09,Male,3:56 AM,43354,13.946,False,Marketing
Jeremy,2008-02-01,Male,8:50 AM,100238,3.887,True,Client Services
Jeremy,2010-09-21,Male,5:56 AM,90370,7.369,False,Human Resources
Joe,1980-01-19,Male,4:06 PM,119667,1.148,True,Finance
Joe,1983-07-04,Male,7:32 AM,62161,8.130,True,Business Development
Joe,1998-12-08,Male,10:28 AM,126120,1.020,False,NaN
Joe,2000-04-14,Male,3:14 PM,50645,11.119,False,Marketing
Joe,2010-12-05,Male,4:20 PM,144082,1.620,True,Client Services

In [52]:
emp = pd.read_csv('./Datasets/employees_3.csv')
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,08/06/93,12:42 p.m.,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 a.m.,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 a.m.,130590,11.858,False,Finance
3,Jerry,Male,03/04/05,1:00 p.m.,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 p.m.,101004,1.389,True,Client Services

In [53]:
emp.set_index('First Name', inplace=True)
emp.head()

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,Male,08/06/93,12:42 p.m.,97308,6.945,True,Marketing
Thomas,Male,3/31/1996,6:53 a.m.,61933,4.170,True,NaN
Maria,Female,4/23/1993,11:17 a.m.,130590,11.858,False,Finance
Jerry,Male,03/04/05,1:00 p.m.,138705,9.340,True,Finance
Larry,Male,1/24/1998,4:47 p.m.,101004,1.389,True,Client Services

In [55]:
emp['Start Date'] = pd.to_datetime(emp['Start Date'])

In [56]:
emp.loc['Louise']

Gender                            Female
Start Date           1980-08-12 00:00:00
Last Login Time                9:01 a.m.
Salary                             63241
Bonus %                           15.132
Senior Management                   True
Team                                 NaN
Name: Louise, dtype: object

In [57]:
# El índice debe existir, de lo contrario se producirá un error
emp.loc['Alberto']

KeyError: 'Alberto'

In [58]:
emp.reset_index(inplace=True)
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,12:42 p.m.,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,6:53 a.m.,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,11:17 a.m.,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,1:00 p.m.,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,4:47 p.m.,101004,1.389,True,Client Services

In [59]:
emp['First Name'].value_counts()

Douglas     1
Thomas      1
Scott       1
Craig       1
John        1
Joshua      1
Matthew     1
Lois        1
Donna       1
Diana       1
Shawn       1
Jeremy      1
Lillian     1
Kimberly    1
Gary        1
Brandon     1
Julie       1
Louise      1
Frances     1
Angela      1
Ruby        1
Dennis      1
Larry       1
Jerry       1
Maria       1
Terry       1
Name: First Name, dtype: int64

In [60]:
emp.set_index('First Name', inplace=True)
emp.head(2)

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Douglas,Male,1993-08-06,12:42 p.m.,97308,6.945,True,Marketing
Thomas,Male,1996-03-31,6:53 a.m.,61933,4.170,True,NaN

In [61]:
emp.sort_index(inplace=True)
emp.head()

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Angela,Female,2005-11-22,6:29 a.m.,95570,18.523,True,Engineering
Brandon,Male,1980-12-01,1:08 a.m.,112807,17.492,True,Human Resources
Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
Dennis,Male,1987-04-18,1:35 a.m.,115163,10.125,False,Legal
Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services

Slicing a través del índice

- El segundo valor si es inclusivo

In [62]:
emp.loc['Craig':'Jeremy']

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
Dennis,Male,1987-04-18,1:35 a.m.,115163,10.125,False,Legal
Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services
Donna,Female,2010-07-22,3:48 a.m.,81014,1.894,False,Product
Douglas,Male,1993-08-06,12:42 p.m.,97308,6.945,True,Marketing
Frances,Female,2002-08-08,6:51 a.m.,139852,7.524,True,Business Development
Gary,Male,2008-01-27,11:40 p.m.,109831,5.831,False,Sales
Jeremy,Male,2010-09-21,5:56 a.m.,90370,7.369,False,Human Resources

También se tiene un párametro _step_

In [63]:
emp.loc['Louise':'Terry':2]

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Louise,Female,1980-08-12,9:01 a.m.,63241,15.132,True,NaN
Matthew,Male,1995-09-05,2:12 a.m.,100612,13.645,False,Marketing
Scott,NaN,1991-07-11,6:58 p.m.,122367,5.218,False,Legal
Terry,Male,1981-11-27,6:30 p.m.,124008,13.464,True,Client Services

Slicing desde un valor hasta el final

In [64]:
emp.loc['John':]

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
John,Male,1992-07-01,10:08 p.m.,97950,13.873,False,Client Services
Joshua,NaN,2012-03-08,1:58 a.m.,90816,18.816,True,Client Services
Julie,Female,1997-10-26,3:19 p.m.,102508,12.637,True,Legal
Kimberly,Female,1999-01-14,7:13 a.m.,41426,14.543,True,Finance
Larry,Male,1998-01-24,4:47 p.m.,101004,1.389,True,Client Services
Lillian,Female,2016-06-05,6:09 a.m.,59414,1.256,False,Product
Lois,NaN,1995-04-22,7:18 p.m.,64714,4.934,True,Legal
Louise,Female,1980-08-12,9:01 a.m.,63241,15.132,True,NaN
Maria,Female,1993-04-23,11:17 a.m.,130590,11.858,False,Finance
Matthew,Male,1995-09-05,2:12 a.m.,100612,13.645,False,Marketing
Ruby,Female,1987-08-17,4:20 p.m.,65476,10.012,True,Product
Scott,NaN,1991-07-11,6:58 p.m.,122367,5.218,False,Legal
Shawn,Male,1986-12-07,7:45 p.m.,111737,6.414,False,Product
Terry,Male,1981-11-27,6:30 p.m.,124008,13.464,True,Client Services
Thomas,Male,1996-03-31,6:53 a.m.,61933,4.170,True,NaN
NaN,Female,2015-07-20,10:43 a.m.,45906,11.598,NaN,Finance
NaN,Male,2012-06-14,4:19 p.m.,125792,5.042,NaN,NaN
NaN,Male,2012-10-08,1:12 a.m.,37076,18.576,NaN,Client Services

Desde el principio hasta el valor indicado

In [66]:
emp.loc[:'Diana']

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Angela,Female,2005-11-22,6:29 a.m.,95570,18.523,True,Engineering
Brandon,Male,1980-12-01,1:08 a.m.,112807,17.492,True,Human Resources
Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
Dennis,Male,1987-04-18,1:35 a.m.,115163,10.125,False,Legal
Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services

Si queremos extraer mas de una fila, se le puede pasar una _lista_

In [67]:
emp.loc[['Angela','Brandon','Jeremy']]

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Angela,Female,2005-11-22,6:29 a.m.,95570,18.523,True,Engineering
Brandon,Male,1980-12-01,1:08 a.m.,112807,17.492,True,Human Resources
Jeremy,Male,2010-09-21,5:56 a.m.,90370,7.369,False,Human Resources

Cada valor en una lista debe existir, regresa la etiqueta inexistente

In [70]:
emp.loc[['Angela','Brandon','Jeremy', 'Alberto']]

KeyError: "['Alberto'] not in index"

In [72]:
'Alberto' in emp.index

False

In [73]:
'Brandon' in emp.index

True

## Extraer registros mediante su posición en el índice --> `iloc[]`

In [74]:
emp.head()

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Angela,Female,2005-11-22,6:29 a.m.,95570,18.523,True,Engineering
Brandon,Male,1980-12-01,1:08 a.m.,112807,17.492,True,Human Resources
Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
Dennis,Male,1987-04-18,1:35 a.m.,115163,10.125,False,Legal
Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services

In [75]:
# Primera fila
emp.iloc[0]

Gender                            Female
Start Date           2005-11-22 00:00:00
Last Login Time                6:29 a.m.
Salary                             95570
Bonus %                           18.523
Senior Management                   True
Team                         Engineering
Name: Angela, dtype: object

In [79]:
emp.iloc[[15,17]]

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Larry,Male,1998-01-24,4:47 p.m.,101004,1.389,True,Client Services
Lois,NaN,1995-04-22,7:18 p.m.,64714,4.934,True,Legal

In [80]:
emp.iloc[4:8]

,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
First Name,,,,,,,
Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services
Donna,Female,2010-07-22,3:48 a.m.,81014,1.894,False,Product
Douglas,Male,1993-08-06,12:42 p.m.,97308,6.945,True,Marketing
Frances,Female,2002-08-08,6:51 a.m.,139852,7.524,True,Business Development

Con `iloc[]` el segundo valor es __NO__ inclusivo.

In [81]:
emp.reset_index(inplace=True)

In [82]:
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Angela,Female,2005-11-22,6:29 a.m.,95570,18.523,True,Engineering
1,Brandon,Male,1980-12-01,1:08 a.m.,112807,17.492,True,Human Resources
2,Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
3,Dennis,Male,1987-04-18,1:35 a.m.,115163,10.125,False,Legal
4,Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services

Para buscar del principio hasta el índice indicado

In [83]:
emp.iloc[:4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Angela,Female,2005-11-22,6:29 a.m.,95570,18.523,True,Engineering
1,Brandon,Male,1980-12-01,1:08 a.m.,112807,17.492,True,Human Resources
2,Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
3,Dennis,Male,1987-04-18,1:35 a.m.,115163,10.125,False,Legal

In [84]:
emp.iloc[[2,4,6,8,10]]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Craig,Male,2000-02-27,7:45 a.m.,37598,7.757,True,Marketing
4,Diana,Female,1981-10-23,10:27 a.m.,132940,19.082,False,Client Services
6,Douglas,Male,1993-08-06,12:42 p.m.,97308,6.945,True,Marketing
8,Gary,Male,2008-01-27,11:40 p.m.,109831,5.831,False,Sales
10,Jerry,Male,2005-03-04,1:00 p.m.,138705,9.340,True,Finance

Para buscar del 15 al final, hay que recordar que el límite inferior si se incluye

In [87]:
emp.iloc[15:]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
15,Larry,Male,1998-01-24,4:47 p.m.,101004,1.389,True,Client Services
16,Lillian,Female,2016-06-05,6:09 a.m.,59414,1.256,False,Product
17,Lois,NaN,1995-04-22,7:18 p.m.,64714,4.934,True,Legal
18,Louise,Female,1980-08-12,9:01 a.m.,63241,15.132,True,NaN
19,Maria,Female,1993-04-23,11:17 a.m.,130590,11.858,False,Finance
20,Matthew,Male,1995-09-05,2:12 a.m.,100612,13.645,False,Marketing
21,Ruby,Female,1987-08-17,4:20 p.m.,65476,10.012,True,Product
22,Scott,NaN,1991-07-11,6:58 p.m.,122367,5.218,False,Legal
23,Shawn,Male,1986-12-07,7:45 p.m.,111737,6.414,False,Product
24,Terry,Male,1981-11-27,6:30 p.m.,124008,13.464,True,Client Services
25,Thomas,Male,1996-03-31,6:53 a.m.,61933,4.170,True,NaN
26,NaN,Female,2015-07-20,10:43 a.m.,45906,11.598,NaN,Finance
27,NaN,Male,2012-06-14,4:19 p.m.,125792,5.042,NaN,NaN
28,NaN,Male,2012-10-08,1:12 a.m.,37076,18.576,NaN,Client Services

Si no existe un valor manda un error

In [88]:
emp.iloc[100]

IndexError: single positional indexer is out-of-bounds

In [89]:
emp.set_index('Start Date', inplace=True)
emp.head()

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
2005-11-22,Angela,Female,6:29 a.m.,95570,18.523,True,Engineering
1980-12-01,Brandon,Male,1:08 a.m.,112807,17.492,True,Human Resources
2000-02-27,Craig,Male,7:45 a.m.,37598,7.757,True,Marketing
1987-04-18,Dennis,Male,1:35 a.m.,115163,10.125,False,Legal
1981-10-23,Diana,Female,10:27 a.m.,132940,19.082,False,Client Services

### Extraer combinaciones de renglón - columna

In [91]:
emp.loc['2000-02-27']

First Name               Craig
Gender                    Male
Last Login Time      7:45 a.m.
Salary                   37598
Bonus %                  7.757
Senior Management         True
Team                 Marketing
Name: 2000-02-27 00:00:00, dtype: object

En este caso se vería algo así
```python
df.loc[renglon, columna]
```

In [95]:
emp.loc['2000-02-27','First Name']

'Craig'

In [93]:
emp.loc['2000-02-27', ['First Name', 'Salary']]

First Name    Craig
Salary        37598
Name: 2000-02-27 00:00:00, dtype: object

Se pueden pasar listas en ambos params

In [96]:
emp.loc[['2000-02-27','1980-12-01'],['First Name','Salary']]

           First Name  Salary
Start Date
2000-02-27      Craig   37598
1980-12-01    Brandon  112807

In [97]:
emp.loc['2000-02-27','First Name':'Bonus %']

First Name             Craig
Gender                  Male
Last Login Time    7:45 a.m.
Salary                 37598
Bonus %                7.757
Name: 2000-02-27 00:00:00, dtype: object

In [98]:
emp.sort_index(inplace=True)

In [99]:
emp.head()

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,,
1980-08-12,Louise,Female,9:01 a.m.,63241,15.132,True,NaN
1980-12-01,Brandon,Male,1:08 a.m.,112807,17.492,True,Human Resources
1981-10-23,Diana,Female,10:27 a.m.,132940,19.082,False,Client Services
1981-11-27,Terry,Male,6:30 p.m.,124008,13.464,True,Client Services
1986-12-07,Shawn,Male,7:45 p.m.,111737,6.414,False,Product

In [100]:
emp.loc['1980-12-01':'1986-12-07', 'First Name':'Bonus %']

           First Name  Gender Last Login Time  Salary  Bonus %
Start Date
1980-12-01    Brandon    Male       1:08 a.m.  112807   17.492
1981-10-23      Diana  Female      10:27 a.m.  132940   19.082
1981-11-27      Terry    Male       6:30 p.m.  124008   13.464
1986-12-07      Shawn    Male       7:45 p.m.  111737    6.414

Desde 'Gender' hasta la última columna

In [101]:
emp.loc['1980-12-01':'1986-12-07', 'Gender':]

,Gender,Last Login Time,Salary,Bonus %,Senior Management,Team
Start Date,,,,,,
1980-12-01,Male,1:08 a.m.,112807,17.492,True,Human Resources
1981-10-23,Female,10:27 a.m.,132940,19.082,False,Client Services
1981-11-27,Male,6:30 p.m.,124008,13.464,True,Client Services
1986-12-07,Male,7:45 p.m.,111737,6.414,False,Product

También se puede hacer del principio hasta una columna en específico

In [102]:
emp.loc['1980-12-01':'1986-12-07', :'Senior Management']

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management
Start Date,,,,,,
1980-12-01,Brandon,Male,1:08 a.m.,112807,17.492,True
1981-10-23,Diana,Female,10:27 a.m.,132940,19.082,False
1981-11-27,Terry,Male,6:30 p.m.,124008,13.464,True
1986-12-07,Shawn,Male,7:45 p.m.,111737,6.414,False

Renglones: desde el inicio hasta el 27 de febrero

Columnas: desde el inicio hasta la columna llamada 'Senior Management'

In [104]:
emp.loc[:'1986-02-27', :'Senior Management']

,First Name,Gender,Last Login Time,Salary,Bonus %,Senior Management
Start Date,,,,,,
1980-08-12,Louise,Female,9:01 a.m.,63241,15.132,True
1980-12-01,Brandon,Male,1:08 a.m.,112807,17.492,True
1981-10-23,Diana,Female,10:27 a.m.,132940,19.082,False
1981-11-27,Terry,Male,6:30 p.m.,124008,13.464,True

Ánalogo va a ser para iloc[]

In [105]:
emp.iloc[10:12, 0:5]

           First Name Gender Last Login Time  Salary  Bonus %
Start Date
1993-08-06    Douglas   Male      12:42 p.m.   97308    6.945
1995-04-22       Lois    NaN       7:18 p.m.   64714    4.934